tutorials/incompressibleFluid/moodyChart/system/Uprofile
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. One graph point is generated in each cell that the line
    intersects.

\*---------------------------------------------------------------------------*/

radius          #calc "$blockMeshDict!diameter / 2.0";

start           (0 0 $radius);
end             (0 0 0);

fields          (U);

axis            distance;

#includeEtc "caseDicts/postProcessing/graphs/graphCell.cfg"

interpolationScheme cell;

// ************************************************************************* //
